In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv('test.csv')

In [2]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [3]:
df.Gender.unique()

array(['Male', 'Female', nan], dtype=object)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 12 columns):
Loan_ID              367 non-null object
Gender               356 non-null object
Married              367 non-null object
Dependents           357 non-null object
Education            367 non-null object
Self_Employed        344 non-null object
ApplicantIncome      367 non-null int64
CoapplicantIncome    367 non-null int64
LoanAmount           362 non-null float64
Loan_Amount_Term     361 non-null float64
Credit_History       338 non-null float64
Property_Area        367 non-null object
dtypes: float64(3), int64(2), object(7)
memory usage: 34.5+ KB

In [5]:
df.shape

(367, 12)

In [6]:
df.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [7]:
df["Property_Area"].value_counts()

Urban        140
Semiurban    116
Rural        111
Name: Property_Area, dtype: int64

In [8]:
df.Dependents.fillna(1,inplace=True)
df.LoanAmount.fillna(df.LoanAmount.mean(),inplace=True)
df.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents            0
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [13]:
Value_mapping={'Yes':1,'No':0}
df['Married_Section']=df.Married.map(Value_mapping)

In [14]:
Value_Mapping1 = {'Male' : 1, 'Female' : 0}
df['Gender_Section'] = df['Gender'].map(Value_Mapping1)
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Gender_Section,Edu_Section,Employed_Section,Married_Section
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban,1.0,1,0.0,1
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban,1.0,1,0.0,1
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban,1.0,1,0.0,1
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban,1.0,1,0.0,1
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban,1.0,0,0.0,0

In [15]:
Value_Mapping2 = {'Graduate' : 1, 'Not Graduate' : 0}
df['Edu_Section'] = df['Education'].map(Value_Mapping2)

In [16]:
Value_Mapping3 = {'Yes' : 1, 'No' : 0}
df['Employed_Section'] = df['Self_Employed'].map(Value_Mapping3)

In [17]:
df["Married_Section"].fillna(df.Married_Section.mean(),inplace=True) 

df["Gender_Section"].fillna(df.Gender_Section.mean(),inplace=True)

df["Loan_Amount_Term"].fillna(df.Loan_Amount_Term.mean(),inplace=True)

df["Credit_History"].fillna(df.Credit_History.mean(),inplace=True)

In [18]:
df.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents            0
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History        0
Property_Area         0
Gender_Section        0
Edu_Section           0
Employed_Section     23
Married_Section       0
dtype: int64

In [19]:
df["Employed_Section"].fillna(df.Employed_Section.mean(),inplace=True)

In [20]:
Value_mapping4={'Urban':0,'Rural':1,'Semiurban':2}
df['property']=df.Property_Area.map(Value_mapping4)

In [21]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Gender_Section,Edu_Section,Employed_Section,Married_Section,property
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.000000,Urban,1.0,1,0.0,1,0
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.000000,Urban,1.0,1,0.0,1,0
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.000000,Urban,1.0,1,0.0,1,0
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,0.825444,Urban,1.0,1,0.0,1,0
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.000000,Urban,1.0,0,0.0,0,0

In [22]:
df.Dependents=df.Dependents.replace('3+',3)

In [23]:
df1=df.drop(['Loan_ID','Gender','Married','Education','Property_Area','Self_Employed'],axis='columns')

df1.head()

In [24]:
df1.head(10)

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Section,Edu_Section,Employed_Section,Married_Section,property
0,0,5720,0,110.0,360.0,1.000000,1.0,1,0.000000,1,0
1,1,3076,1500,126.0,360.0,1.000000,1.0,1,0.000000,1,0
2,2,5000,1800,208.0,360.0,1.000000,1.0,1,0.000000,1,0
3,2,2340,2546,100.0,360.0,0.825444,1.0,1,0.000000,1,0
4,0,3276,0,78.0,360.0,1.000000,1.0,0,0.000000,0,0
5,0,2165,3422,152.0,360.0,1.000000,1.0,0,1.000000,1,0
6,1,2226,0,59.0,360.0,1.000000,0.0,0,0.000000,0,2
7,2,3881,0,147.0,360.0,0.000000,1.0,0,0.000000,1,1
8,2,13633,0,280.0,240.0,1.000000,1.0,1,0.107558,1,0
9,0,2400,2400,123.0,360.0,1.000000,1.0,0,0.000000,0,2

In [25]:
df1.shape

(367, 11)

In [33]:
x=df1

In [34]:
x.shape

(367, 11)

In [32]:
from sklearn.externals import joblib
mj=joblib.load('model_joblib')

In [36]:
y=mj.predict(x)

In [39]:
ss=pd.read_csv('sample_submission_49d68Cx.csv')

In [40]:
ss['Predicted']=y

In [41]:
ss.head()

    Loan_ID Loan_Status Predicted
0  LP001015           N         Y
1  LP001022           N         Y
2  LP001031           N         Y
3  LP001035           N         Y
4  LP001051           N         Y

In [42]:
ss1=ss.drop('Loan_Status',axis='columns')

In [43]:
ss1.to_csv('Final_submission.csv')

In [248]:
from sklearn.externals import joblib
joblib.dump(model,'model_joblib')

['model_joblib']